IDENTIFICATION DIVISION.
PROGRAM-ID. TodoApp.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 Todos OCCURS 0 TO 100 TIMES DEPENDING ON Todos-Count.
       05 Todo-Item PIC X(50).